<script lang="ts" setup></script>

<template>
  <div class="jk-environment">
    <p>
      Жилой комплекс «Новое Жегалово» расположен в одном из самых зелёных и
      спокойных районов Щёлково. Здесь легко почувствовать баланс между
      городским комфортом и природной гармонией.
    </p>
    <p>
      В шаговой доступности — живописные лесные массивы, где можно гулять в
      любое время года: летом — наслаждаться прохладой и свежим воздухом, осенью
      — яркими красками природы, зимой — тишиной заснеженных троп, а весной —
      пробуждением жизни.
    </p>
    <p>
      Всего в нескольких минутах от жилого комплекса находится озеро Сиваш —
      уютное место для прогулок и отдыха на природе. Здесь можно провести время
      у воды, насладиться тишиной, порыбачить или просто перезагрузиться после
      городского дня.
    </p>
    <p>
      Недалеко от комплекса протекает река Клязьма — отличное место для
      прогулок, отдыха у воды и семейных выходных. Уютные берега и природные
      пейзажи создают атмосферу загородной жизни, не покидая города.
    </p>

    <p>
      Чистый воздух, зелёные зоны и отсутствие городской суеты делают «Новое
      Жегалово» идеальным местом для тех, кто ценит здоровье, спокойствие и
      комфорт.
    </p>
  </div>
</template>

<style lang="scss" scoped>
.jk-environment {
  & p + p {
    margin-top: 20px;
  }
}
</style>
