<script lang="ts" setup></script>

<template>
  <div class="info-environment">
    <div class="sivash"></div>
    <h2 class="font-default">
      Глоток <span class="font-bold">свежести</span> среди величия природы
    </h2>
    <div class="text">
      <p>
        <span></span>Жилой комплекс «Новое Жегалово» расположен в одном из самых
        зелёных и спокойных районов Щёлково. Здесь легко почувствовать баланс
        между городским комфортом и природной гармонией.
      </p>
      <!-- <p>
        В шаговой доступности — живописные лесные массивы, где можно гулять в
        любое время года: летом — наслаждаться прохладой и свежим воздухом,
        осенью — яркими красками природы, зимой — тишиной заснеженных троп, а
        весной — пробуждением жизни.
      </p> -->

      <p>На территории природного заповедника Лосиный остров</p>

      <p>
        Всего в нескольких минутах от жилого комплекса находится живописное
        озеро Сиваш — уютное место для прогулок и отдыха на природе. Здесь можно
        провести время у воды, насладиться тишиной, порыбачить или просто
        перезагрузиться после городского дня.
      </p>
      <p>
        Недалеко от комплекса протекает река Клязьма — отличное место для
        прогулок, отдыха у воды и семейных выходных. Уютные берега и природные
        пейзажи создают атмосферу загородной жизни, не покидая города.
      </p>

      <p>
        Чистый воздух, зелёные зоны и отсутствие городской суеты делают «Новое
        Жегалово» идеальным местом для тех, кто ценит здоровье, спокойствие и
        комфорт.
      </p>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.info-environment {
  width: 100%;
  height: 100%;
  font-size: 20px;
  margin-bottom: 30px;
  display: flex;
  flex-direction: column;

  & .sivash {
    background: url("/images/ViewFromLake.webp") center 70% / cover no-repeat;
    height: 50%;
  }

  & > h2 {
    color: var(--color-blue);
    font-size: 40px;
    text-transform: uppercase;
    margin-top: 12px;
  }

  & .text {
    overflow-y: auto;
  }
}
</style>
